** DONE source block A-0-29 table 3-column  sed 目 錄 第一部份：檔案格式及資料描述
#+HEADERS: :results raw

#+HEADERS: :noweb yes
#+HEADERS: :session
#+BEGIN_SRC sh
<<the_pdf_name_block>>

# pdftotext -f 1 -l 3 -raw -nopgbrk $the_pdf_filename - | head

# pdftotext -f 1 -l 5 -raw $the_pdf_filename - | grep -E 'A-[0-9]+$' | cut -d"-" -f2

# pdftotext -f 1 -l 5 -raw $the_pdf_filename - | sed -nr 's:([^.]+)[.]{5,}[ ]?A-([0-9]+)$:|\1|\2|:p'


echo "

 s:[.]{3,}:: 
 s:(.*)A-([0-9]{1,2}):\2 \1:
 s:（: :   
 s:）: :
 s:\[適用 : :
 s:([0-9]{2,3})～([0-9]{2,3})(.*): \1 \2:
 s:([0-9]{2,3})~([0-9]{2,3})(.*): \1 \2:
 s:([0-9]{2,3})( 年以後資料]):\1 105:
 s:([0-9]{2,3})( 年以前資料]):80 \1:
 s:[ ]{2,}: :gp


" > temporary_script_for_sed

# cat temporary_script_for_sed

pdftotext -f 1 -l 3 -nopgbrk -raw $the_pdf_filename - | sed -nrf temporary_script_for_sed

rm temporary_script_for_sed
#+END_SRC

#+RESULTS:
|  1 | 醫事機構基本資料檔         | HOSB    |     |     |
|  3 | 醫事機構副檔資料檔         | HOSX    |     |     |
|  5 | 醫事機構服務項目檔         | HOX     |     |     |
|  6 | 醫事機構診療科別明細檔     | DETA    |     |     |
|  7 | 醫事機構病床主檔           | BED     |     |     |
|  8 | 醫事人員基本資料檔         | PER     |     |     |
|  9 | 專科醫師證書主檔           | DOC     |  86 | 100 |
| 10 | 專科醫師證書主檔           | DOC     | 101 | 105 |
| 12 | 醫事機構類別明細檔         | HOSTDTL |     |     |
| 13 | 執業資料紀錄檔             | LIC     |     |     |
| 14 | 重大傷病證明明細檔         | HV      |  85 |  93 |
| 15 | 重大傷病證明明細檔         | HV      |  94 |  98 |
| 16 | 重大傷病證明明細檔         | HV      |  99 | 100 |
| 17 | 重大傷病證明明細檔         | HV      | 101 | 105 |
| 18 | 門診費用申請總表主檔       | CT      |  80 | 100 |
| 20 | 門診費用申請總表主檔       | CT      | 101 | 105 |
| 22 | 住院費用申請總表主檔       | DT      |  80 | 100 |
| 23 | 住院費用申請總表主檔       | DT      | 101 | 105 |
| 25 | 門診處方及治療明細檔       | CD      |  86 |  92 |
| 30 | 門診處方及治療明細檔       | CD      |  93 | 100 |
| 35 | 門診處方及治療明細檔       | CD      | 101 | 105 |
| 41 | 門診處方醫令明細檔         | OO      |  85 |  95 |
| 43 | 門診處方醫令明細檔         | OO      |  96 | 100 |
| 46 | 門診處方醫令明細檔         | OO      | 101 | 105 |
| 50 | 住院醫療費用清單明細檔     | DD      |  85 |  92 |
| 55 | 住院醫療費用清單明細檔     | DD      |  93 |  95 |
| 60 | 住院醫療費用清單明細檔     | DD      |  96 | 100 |
| 65 | 住院醫療費用清單明細檔     | DD      | 101 | 105 |
| 71 | 住院醫療費用醫令清單明細檔 | DO      |  85 |  95 |
| 72 | 住院醫療費用醫令清單明細檔 | DO      |  96 |  98 |
| 74 | 住院醫療費用醫令清單明細檔 | DO      |  99 | 100 |
| 76 | 住院醫療費用醫令清單明細檔 | DO      | 101 | 105 |
| 79 | 特約藥局處方及調劑明細檔   | GD      |  85 |  87 |
| 80 | 特約藥局處方及調劑明細檔   | GD      |  88 |  92 |
| 82 | 特約藥局處方及調劑明細檔   | GD      |  93 |  98 |
| 84 | 特約藥局處方及調劑明細檔   | GD      |  99 | 100 |
| 86 | 特約藥局處方及調劑明細檔   | GD      | 101 | 105 |
| 88 | 特約藥局處方調劑醫令檔     | GO      |  85 |  95 |
| 89 | 特約藥局處方調劑醫令檔     | GO      |  96 | 100 |
| 90 | 特約藥局處方調劑醫令檔     | GO      | 101 | 105 |
| 91 | 物理治療所調劑明細檔       | GDD     |     |     |
| 93 | 物理治療所調劑醫令檔       | GOO     |     |     |
| 94 | 承保資料檔                 | ID      |  80 |  98 |
| 96 | 承保資料檔                 | ID      |  99 | 105 |
| 97 | 藥品主檔                   | DRUG    |     |     |




** source block B-4, 權屬別及型態別其代號與名稱

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
 <<the_pdf_name_block>>

            pdftotext -f 6 -l 10 -nopgbrk -raw $the_pdf_filename -

#+END_SRC

#+RESULTS:
B-4 權屬別及型態別其代號與名稱

一、醫療機構

| 權屬別 |                              |
|     01 | 署、市立醫院                 |
|     02 | 縣市立醫院                   |
|     04 | 公立醫學院校附設醫院         |
|     05 | 軍方醫院(民眾診療)           |
|     06 | 榮民醫院                     |
|     07 | 機關(構)附設醫院             |
|     08 | 公立中醫醫院                 |
|     09 | 社團法人醫院                 |
|     10 | 宗教社團法人附設醫院         |
|     11 | 財團法人醫院                 |
|     12 | 宗教財團法人附設醫院         |
|     13 | 私立醫學院校附設醫院         |
|     14 | 其他法人附設醫院             |
|     15 | 私立醫院                     |
|     17 | 私立牙醫醫院                 |
|     18 | 私立中醫院                   |
|     21 | 市立診所                     |
|     22 | 縣市立診所                   |
|     23 | 衛生所                       |
|     24 | 公立學校附設醫務室           |
|     25 | 軍方診所(民眾診療附設門診部) |
|     26 | 榮民診所(榮家醫務室)         |
|     27 | 機關(構)附設醫務室           |
|     28 | 公立中醫診所                 |
|     29 | 公益法人所設診所             |
|     30 | 公益法人所設醫務室           |
|     31 | 財團法人附設醫務室           |
|     32 | 宗教財團法人附設診所、醫務室 |
|     33 | 私立學校附設醫務室           |
|     34 | 事業單位附設醫務室           |
|     35 | 私立診所                     |
|     37 | 私立牙醫診所                 |
|     38 | 私立中醫診所                 |
|     40 | 醫療財團法人診所             |
|     41 | 醫療社團法人診所             |
|     42 | 財團法人其他醫療機構         |
|     45 | 私立其他醫療機構             |


|              型態別 |                  |
|---------------------+------------------|
|         醫院：01-08 |                  |
|                  01 | 綜合醫院         |
|                  02 | 醫院             |
|                  03 | 專科醫院         |
|                  04 | 精神科醫院       |
|                  05 | 特殊科醫院       |
|                  06 | 慢性醫院         |
|                  07 | 專科診所         |
|                  08 | 一般診所(醫務室) |
|                  09 | 特殊科診所       |
|---------------------+------------------|
|         牙醫：11-13 |                  |
|                  11 | 牙醫醫院         |
|                 B-5 |                  |
|                  12 | 牙醫專科診所     |
|                  13 | 牙醫一般診所     |
|---------------------+------------------|
|         中醫：21-24 |                  |
|                  21 | 中醫綜合醫院     |
|                  22 | 中醫醫院         |
|                  23 | 中醫專科診所     |
|                  24 | 中醫一般診所     |
|---------------------+------------------|
| 其他醫療機構：41-43 |                  |
|                  41 | 捐血中心         |
|                  42 | 捐血站           |
|                  43 | 病理中心         |

二、藥商

|            權屬別 |                |
|-------------------+----------------|
| 販賣業：51-53、62 |                |
|                51 | 西藥販賣業     |
|                52 | 中藥販賣業     |
|                53 | 醫療器材販賣業 |
|                62 | 販賣業         |
|-------------------+----------------|
| 製造業：54-58、61 |                |
|                54 | 西藥製造業     |
|                55 | 中藥製造業     |
|                56 | 醫療器材製造業 |
|                57 | 明膠膠囊製造業 |
|                58 | 化妝品製造業   |
|                61 | 製造業         |
|-------------------+----------------|
|       其他：59-60 |                |
|                59 | 藥局           |
|                60 | 列冊中藥商     |



| 型態別 |                                    |
|--------+------------------------------------|
|     01 | 藥師自營                           |
|     02 | 藥劑生自營                         |
|     03 | 藥師駐店管理                       |
|     04 | 藥劑生駐店管理                     |
|     05 | 符合藥事法104條規定─藥師管理       |
|     06 | 符合藥事法104條規定─藥劑生管理     |
|     07 | 中醫師駐店管理                     |
|     08 | 中醫師兼管                         |
|     09 | 藥師兼管                           |
|     11 | 確具中藥基本知識及鑑別能力人員管理 |
|     12 | 人用生物藥品製造廠                 |
|     13 | 藥師監製                           |
|     14 | 中醫師監製                         |
|     16 | 列冊中藥商                         |


三、護理護產機構


| 權屬別 |                              |
|--------+------------------------------|
|     71 | 公立護產機構                 |
|     72 | 財團法人護產機構             |
|     73 | 其他法人附設護產機構         |
|     74 | 個人開設護產機構             |
|     75 | 公立醫療機構附設護產機構     |
|     76 | 私立醫療機構附設護產機構     |
|     77 | 財團法人醫療機構附設護產機構 |
|     78 | 其他                         |
|     79 | 社團法人醫療機構附設護產機構 |


| 型態別 |                            |
|--------+----------------------------|
|     01 | 護理之家                   |
|     02 | 居家護理                   |
|     03 | 產後護理                   |
|     04 | 助產所                     |
|     05 | 學校醫務室─校護            |
|     06 | 事業單位醫務室─廠護        |
|     07 | 社會福利機構               |
|     08 | 機關醫護室                 |
|     09 | 學校護理教育(實習指導老師) |
|     10 | 日間照護                   |
|     00 | 其他                       |


四、精神復健機構

| 權屬別 |                                  |
|--------+----------------------------------|
|     81 | 公立精神復健機構                 |
|     82 | 財團法人精神復健機構             |
|     83 | 其他法人附設精神復健機構         |
|     84 | 私立精神復健機構                 |
|     85 | 公立醫療機構附設精神復健機構     |
|     86 | 私立醫療機構附設精神復健機構     |
|     87 | 財團法人醫療機構附設精神復健機構 |
|     88 | 精神衛生團體附設精神復健機構     |


| 型態別 |              |
|--------+--------------|
|     08 | 社區復健中心 |
|     09 | 康復之家     |



五、其他醫事機構

| 權屬別 |                                  |
|--------+----------------------------------|
|     91 | 公立其他醫事機構                 |
|     92 | 財團法人其他醫事機構             |
|     93 | 其他法人附設其他醫事機構         |
|     94 | 私立其他醫事機構                 |
|     95 | 公立醫療機構附設其他醫事機構     |
|     96 | 私立醫療機構附設其他醫事機構     |
|     97 | 財團法人醫療機構附設其他醫事機構 |
|     98 | 其他                             |
|     xx | 不詳                             |



| 型態別 |                    |
|--------+--------------------|
|     01 | 醫事檢驗所         |
|     02 | 醫事放射所         |
|     03 | 物理治療所         |
|     04 | 職能治療所         |
|     05 | 鑲牙所             |
|     06 | 齒模製造技術員     |
|     07 | 國術損傷接骨技術員 |
|     00 | 其他               |
|     xx | 不詳               |



** source block B-53 專科醫師代號、科別

#+HEADERS: :noweb yes
#+HEADERS: :results raw
#+HEADERS: :session
#+BEGIN_SRC sh
#  the_pdf_filename="en_codeformat.pdf"  #A
 the_pdf_filename="en_codedescribe.pdf"  #B

            pdftotext -f 55 -l 56 -nopgbrk -raw $the_pdf_filename -

#+END_SRC

#+RESULTS:
B-53
專科醫師代號、科別
| 代號         | 專科別           |
| A0100        | 家庭醫學科       |
| A0200        | 內科             |
| A0201        | 心臟專科         |
| A0202        | 腎臟科           |
| A0203        | 胸腔暨重症專科   |
| A0204        | 心臟外專科       |
| A0205        | 心臟血管外科     |
| A0206        | 胸腔外科         |
| A0207        | 結核病專科       |
| A0208        | 感染症專科       |
| A02AA        | 新陳代謝科       |
| A0299        | 職業病科         |
| A0300        | 外科             |
| A0301        | 整形外科         |
| A0400        | 小兒科           |
| A0500        | 婦產科           |
| A0600        | 骨科             |
| A0700        | 神經科           |
| A0800        | 神經外科         |
| A0900        | 泌尿科           |
| A1000        | 耳鼻喉科         |
| A1100        | 眼科             |
| A1200        | 皮膚科           |
| A1300        | 精神科           |
| A1400        | 復健科           |
| A1500        | 麻醉科           |
| A1600        | 放射線科（診斷） |
| A1610        | 放射線科（腫瘤） |
| A1620        | 放射線科（核醫） |
| A2000        | 病理科（解剖）   |
| A2010        | 病理科（臨床）   |
| A2100        | 核子醫學科       |
| A0299        | 職業病科         |
| A2200        | 急診醫學科       |
| A2400        | 職業醫學科       |
| A2500        | 口腔顎面外科     |
| C0700        | 口腔顎面外科     |
| B0100        | 中醫內科         |
| B0200        | 中醫外科         |
| B0300        | 中醫婦科         |
| B0400        | 中醫兒科         |
| B0600        | 中醫眼科         |
| C0100        | 牙科不分科       |
| C0900        | 口腔病理科       |




** DONE source block A-0-27 table 3-column  sed

#+HEADERS: :results raw
#+HEADERS: :noweb yes
#+HEADERS: :session
#+BEGIN_SRC sh
<<the_pdf_name_block>>

 pdftotext -f 1 -l 3 -raw -nopgbrk $the_pdf_filename - | head

# pdftotext -f 1 -l 5 -raw $the_pdf_filename - | grep -E 'A-[0-9]+$' | cut -d"-" -f2

# pdftotext -f 1 -l 5 -raw $the_pdf_filename - | sed -nr 's:([^.]+)[.]{5,}[ ]?A-([0-9]+)$:|\1|\2|:p'


echo "

s:[.]{3,}:: 
s:(.*)A-([0-9]{1,2}):\2 \1:
s:（: :   
s:）: :
s:\[適用 : :
s:([0-9]{2,3})～([0-9]{2,3})(.*): \1 \2:
s:([0-9]{2,3})~([0-9]{2,3})(.*): \1 \2:
s:([0-9]{2,3})( 年以後資料]):\1 105:
s:([0-9]{2,3})( 年以前資料]): 80 \1:
s:[ ]+:|:g
# s:^[A-Z].*+::g

" > temporary_script_for_sed

# cat temporary_script_for_sed

pdftotext -f 1 -l 3 -nopgbrk -raw $the_pdf_filename - | sed -rf temporary_script_for_sed

rm temporary_script_for_sed
#+END_SRC

#+RESULTS:
A-I V.102-11
目 錄
第一部份：檔案格式及資料描述
醫事機構基本資料檔（HOSB）................................................................. A-1
醫事機構副檔資料檔（HOSX）................................................................. A-3
醫事機構服務項目檔（HOX）................................................................... A-5
醫事機構診療科別明細檔（DETA） ......................................................... A-6
醫事機構病床主檔（BED）........................................................................ A-7
醫事人員基本資料檔（PER） .................................................................... A-8
專科醫師證書主檔（DOC）[適用 86～100 年資料] ................................ A-9
A-I|V.102-11
目|錄
第一部份：檔案格式及資料描述
1|醫事機構基本資料檔|HOSB|
3|醫事機構副檔資料檔|HOSX|
5|醫事機構服務項目檔|HOX|
6|醫事機構診療科別明細檔|DETA|
7|醫事機構病床主檔|BED|
8|醫事人員基本資料檔|PER|
9|專科醫師證書主檔|DOC|86|100
10|專科醫師證書主檔|DOC|101|105|
11|評鑑資料檔|HOSP_GRAD|
12|醫事機構類別明細檔|HOSTDTL|
13|執業資料紀錄檔|LIC|
14|重大傷病證明明細檔|HV|85|93
15|重大傷病證明明細檔|HV|94|98
16|重大傷病證明明細檔|HV|99|100
17|重大傷病證明明細檔|HV|101|105|
18|門診費用申請總表主檔|CT|80|100|
V.102-11|A-II
20|門診費用申請總表主檔|CT|101|105|
22|住院費用申請總表主檔|DT|80|100|
23|住院費用申請總表主檔|DT|101|105|
25|門診處方及治療明細檔|CD|86|92
30|門診處方及治療明細檔|CD|93|100
35|門診處方及治療明細檔|CD|101|105|
41|門診處方醫令明細檔|OO|85|95
43|門診處方醫令明細檔|OO|96|100
46|門診處方醫令明細檔|OO|101|105|
50|住院醫療費用清單明細檔|DD|85|92
55|住院醫療費用清單明細檔|DD|93|95
60|住院醫療費用清單明細檔|DD|96|100
65|住院醫療費用清單明細檔|DD|101|105|
71|住院醫療費用醫令清單明細檔|DO|85|95
72|住院醫療費用醫令清單明細檔|DO|96|98
74|住院醫療費用醫令清單明細檔|DO|99|100
76|住院醫療費用醫令清單明細檔|DO|101|105|
79|特約藥局處方及調劑明細檔|GD|85|87
80|特約藥局處方及調劑明細檔|GD|88|92
A-III|V.102-11
82|特約藥局處方及調劑明細檔|GD|93|98
84|特約藥局處方及調劑明細檔|GD|99|100
86|特約藥局處方及調劑明細檔|GD|101|105|
88|特約藥局處方調劑醫令檔|GO|85|95
89|特約藥局處方調劑醫令檔|GO|96|100
90|特約藥局處方調劑醫令檔|GO|101|105|
91|物理治療所調劑明細檔|GDD|
93|物理治療所調劑醫令檔|GOO|
94|承保資料檔|ID|80|98|
96|承保資料檔|ID|99|105|
97|藥品主檔|DRUG|
※本譯碼簿僅供參考，資料描述或代碼說明資訊如有異動，請逕自全民健康保險
署網站|http://www.nhi.gov.tw/|查閱。


** DONE source block A-41 line


#+HEADERS: :results raw
#+HEADERS: :noweb yes
#+HEADERS: :session
#+BEGIN_SRC sh
<<the_pdf_name_block>>

# pdftotext -f 1 -l 3 -raw -nopgbrk $the_pdf_filename - | head


cmc_f=1        # first page number to parse

cmc_l=2        # last page number to parse

echo "

:A-41:=

" > temporary_script_for_sed

# cat temporary_script_for_sed

# pdftotext -f $cmc_f -l $cmc_l -nopgbrk -raw $the_pdf_filename - # | sed -rf temporary_script_for_sed

# pdftotext -nopgbrk -raw $the_pdf_filename -  | sed -nf temporary_script_for_sed

pdftotext -nopgbrk -raw $the_pdf_filename -  | sed -n '/A-43/='

rm temporary_script_for_sed
#+END_SRC

#+RESULTS:
28
1836


** DONE source test


#+HEADERS: :results raw
#+HEADERS: :noweb yes
#+HEADERS: :session
#+BEGIN_SRC sh

# echo -e 'LineA\nLineB' 

# echo -e 'LineA\nLineB\nLineC\nLineD' | sed -e 'N' -e 's/\n/+/'
 echo -e 'LineA\nLineB\nLineC' | sed -e 'N' -e 's/\n/+/'



#+END_SRC

#+RESULTS:
LineA+LineB
LineC



